<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"0e5a5d1d4256509a4d18c04a4141714bf169bbd50c86a77c1dfa500c0bea4a0c","plan_job_ref":"Job terraform plan #14 at https://github.com/PyratLtd/terraform-module-library/actions/runs/9568046978","plan_out_hash":"83a7b3f55be7347f406ab80b15d23acc43931f0710947314e3943801225ecf73","plan_hash":"a4e4fc04d13c9fdfa7b0d418daf901e1ea28f3da73b4fa20cb5727bf36d3ad29","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __azure/network/test__
<details>
<summary>Plan: 4 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # module.network.azurerm_dns_zone.this["test-myzone-com"] will be created
+   resource "azurerm_dns_zone" "this" {
+       id                        = (known after apply)
+       max_number_of_record_sets = (known after apply)
+       name                      = "test.myzone.com"
+       name_servers              = (known after apply)
+       number_of_record_sets     = (known after apply)
+       resource_group_name       = "uks-nonprod-sandbox-pyrat-test-network-rg"
+       tags                      = {
+           "Attributes"   = "network"
+           "Created-By"   = "terraform"
+           "Environment"  = "nonprod"
+           "Location"     = "uks"
+           "Name"         = "test"
+           "Organisation" = "pyrat"
+           "Stage"        = "sandbox"
+           "Tenant"       = "pyratpayg"
        }

+       soa_record {
+           email         = (known after apply)
+           expire_time   = (known after apply)
+           fqdn          = (known after apply)
+           host_name     = (known after apply)
+           minimum_ttl   = (known after apply)
+           refresh_time  = (known after apply)
+           retry_time    = (known after apply)
+           serial_number = (known after apply)
+           tags          = (known after apply)
+           ttl           = (known after apply)
        }
    }

  # module.network.azurerm_resource_group.this will be created
+   resource "azurerm_resource_group" "this" {
+       id       = (known after apply)
+       location = "uksouth"
+       name     = "uks-nonprod-sandbox-pyrat-test-network-rg"
+       tags     = {
+           "Attributes"   = "network"
+           "Created-By"   = "terraform"
+           "Environment"  = "nonprod"
+           "Location"     = "uks"
+           "Name"         = "test"
+           "Organisation" = "pyrat"
+           "Stage"        = "sandbox"
+           "Tenant"       = "pyratpayg"
        }
    }

  # module.network.module.azure_network.data.azurerm_resource_group.network[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "network" {
+       id         = (known after apply)
+       location   = (known after apply)
+       managed_by = (known after apply)
+       name       = "uks-nonprod-sandbox-pyrat-test-network-rg"
+       tags       = (known after apply)
    }

  # module.network.module.azure_network.azurerm_subnet.subnet_for_each["general"] will be created
+   resource "azurerm_subnet" "subnet_for_each" {
+       address_prefixes                               = [
+           "10.0.1.0/25",
        ]
+       default_outbound_access_enabled                = true
+       enforce_private_link_endpoint_network_policies = false
+       enforce_private_link_service_network_policies  = (known after apply)
+       id                                             = (known after apply)
+       name                                           = "general"
+       private_endpoint_network_policies              = (known after apply)
+       private_endpoint_network_policies_enabled      = (known after apply)
+       private_link_service_network_policies_enabled  = (known after apply)
+       resource_group_name                            = "uks-nonprod-sandbox-pyrat-test-network-rg"
+       virtual_network_name                           = "uks-nonprod-sandbox-pyrat-test-network"
    }

  # module.network.module.azure_network.azurerm_virtual_network.vnet will be created
+   resource "azurerm_virtual_network" "vnet" {
+       address_space       = [
+           "10.0.0.0/16",
        ]
+       dns_servers         = []
+       guid                = (known after apply)
+       id                  = (known after apply)
+       location            = (known after apply)
+       name                = "uks-nonprod-sandbox-pyrat-test-network"
+       resource_group_name = "uks-nonprod-sandbox-pyrat-test-network-rg"
+       subnet              = (known after apply)
+       tags                = {
+           "Attributes"   = "network"
+           "Created-By"   = "terraform"
+           "Environment"  = "nonprod"
+           "Location"     = "uks"
+           "Name"         = "test"
+           "Organisation" = "pyrat"
+           "Stage"        = "sandbox"
+           "Tenant"       = "pyratpayg"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Warnings:

- Argument is deprecated
  on /tmp/terraform-data-dir/modules/network.azure_network/main.tf line 57

To see the full warning notes, run Terraform without -compact-warnings.
```
</details>

:memo: Plan generated in [terraform plan #14](https://github.com/PyratLtd/terraform-module-library/actions/runs/9568046978)